#!/bin/sh

# tap repos
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"

# install brew formulas
brew "aspell"
brew "bat"
brew "btop"
brew "clipboard"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "python"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "git"
brew "glow"
brew "go"
brew "lsd"
brew "lux"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "newsboat"
brew "node"
brew "openblas"
brew "pkgconf"
brew "poppler"
brew "ripgrep"
brew "rust"
brew "sdcv"
brew "starship"
brew "tldr"
brew "tmux"
brew "wget"
brew "yazi"

# install formulas from third-part repos
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# install fonts
cask "blender"
cask "font-lxgw-wenkai"
cask "font-maple-mono"
cask "font-sf-mono"
cask "sf-symbols"

# install cask apps
cask "ghostty"
cask "input-source-pro"
cask "jordanbaird-ice"
cask "mactex-no-gui"
cask "numi"
cask "pdf-expert"
cask "pearcleaner"
cask "sip"
cask "spaceid"
cask "squirrel"
cask "visual-studio-code"
cask "zoom"
